window.statistics = [
    {
        id: "2021-08",
        month: "สิงหาคม 2564",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 88.60,
            west: 96.58,
            total: 92.61
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 98.01,
            west: 97.90,
            total: 97.95
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.44,
            west: 99.49,
            total: 99.46
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 0,
            west: 0,
            total: 0
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 0,
            west: 0,
            total: 0
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2021-09",
        month: "กันยายน 2564",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.65,
            west: 89.02,
            total: 94.30
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.78,
            west: 89.06,
            total: 94.39
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 89.15,
            total: 94.54
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 0,
            west: 0,
            total: 0
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 0,
            west: 0,
            total: 0
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2021-10",
        month: "ตุลาคม 2564",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 98.99,
            west: 71.22,
            total: 85.02
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.46,
            west: 71.22,
            total: 85.24
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.79,
            west: 71.34,
            total: 85.47
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 53481,
            west: 25080,
            total: 78560
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 2382,
            west: 1725,
            total: 4107
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 5,
            west: 693,
            total: 698
        }
    },
    {
        id: "2021-11",
        month: "พฤศจิกายน 2564",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 97.10,
            west: 100,
            total: 98.40
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.28,
            west: 100,
            total: 99.60
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 63719,
            west: 30706,
            total: 94425
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 2838,
            west: 2112,
            total: 4950
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 2,
            west: 40,
            total: 42
        }
    },
    {
        id: "2021-12",
        month: "ธันวาคม 2564",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 98.74,
            west: 97.62,
            total: 98.24
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.91,
            west: 98.34,
            total: 99.20
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.98,
            west: 98.97,
            total: 99.52
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 96297,
            west: 50130,
            total: 146427
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4289,
            west: 3448,
            total: 7737
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 1,
            west: 36,
            total: 37
        }
    },
    {
        id: "2022-01",
        month: "มกราคม 2565",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.53,
            west: 99.94,
            total: 99.72
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.72,
            west: 100,
            total: 99.85
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.77,
            west: 100,
            total: 99.87
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 95825,
            west: 50479,
            total: 146305
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4268,
            west: 3472,
            total: 7740
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 10,
            west: 0,
            total: 10
        }
    },
    {
        id: "2022-02",
        month: "กุมภาพันธ์ 2565",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.56,
            west: 99.25,
            total: 99.43
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.64,
            west: 99.62,
            total: 99.63
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.66,
            west: 99.70,
            total: 99.68
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 86463,
            west: 38499,
            total: 124962
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 3851,
            west: 2648,
            total: 6499
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 13,
            west: 8,
            total: 21
        }
    },
    {
        id: "2022-03",
        month: "มีนาคม 2565",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.63,
            west: 99.85,
            total: 99.71
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.86,
            west: 100,
            total: 99.91
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.95,
            west: 100,
            total: 99.97
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 96005,
            west: 39662,
            total: 135667
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4276,
            west: 2728,
            total: 7004
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 2,
            west: 0,
            total: 2
        }
    },
    {
        id: "2022-04",
        month: "เมษายน 2565",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.88,
            west: 99.96,
            total: 99.91
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.98,
            west: 100,
            total: 99.99
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 92951,
            west: 38383,
            total: 131334
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4140,
            west: 2640,
            total: 6780
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2022-05",
        month: "พฤษภาคม 2565",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.42,
            west: 99.30,
            total: 99.37
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.77,
            west: 99.45,
            total: 99.64
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.86,
            west: 100,
            total: 99.91
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 95915,
            west: 39662,
            total: 135577
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4272,
            west: 2728,
            total: 7000
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 6,
            west: 0,
            total: 6
        }
    },
    {
        id: "2022-06",
        month: "มิถุนายน 2565",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.83,
            west: 99.89,
            total: 99.85
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.90,
            west: 100,
            total: 99.94
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.90,
            west: 100,
            total: 99.94
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 92861,
            west: 39372,
            total: 132233
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4136,
            west: 2708,
            total: 6844
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 4,
            west: 0,
            total: 4
        }
    },
    {
        id: "2022-07",
        month: "กรกฎาคม 2565",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 95.72,
            west: 99.89,
            total: 97.39
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.91,
            west: 100,
            total: 99.94
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 96050,
            west: 41465,
            total: 137515
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4278,
            west: 2852,
            total: 7130
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2022-08",
        month: "สิงหาคม 2565",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 98.34,
            west: 99.96,
            total: 98.99
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.88,
            west: 100,
            total: 99.93
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 96050,
            west: 41465,
            total: 137515
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4278,
            west: 2852,
            total: 7130
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2022-09",
        month: "กันยายน 2565",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.40,
            west: 99.93,
            total: 99.61
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.76,
            west: 99.96,
            total: 99.84
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.98,
            west: 99.96,
            total: 99.97
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 92929,
            west: 40113,
            total: 133042
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4139,
            west: 2759,
            total: 6898
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 1,
            west: 1,
            total: 2
        }
    },
    {
        id: "2022-10",
        month: "ตุลาคม 2565",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.74,
            west: 99.89,
            total: 99.80
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.98,
            west: 100,
            total: 99.99
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 96050,
            west: 41465,
            total: 137515
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4278,
            west: 2852,
            total: 7130
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2022-11",
        month: "พฤศจิกายน 2565",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.90,
            west: 99.82,
            total: 99.87
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 92951,
            west: 40128,
            total: 133079
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4140,
            west: 2760,
            total: 6900
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2022-12",
        month: "ธันวาคม 2565",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 96.94,
            west: 99.83,
            total: 98.09
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.95,
            west: 99.90,
            total: 99.93
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 96050,
            west: 41582,
            total: 137631
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4278,
            west: 2860,
            total: 7138
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2023-01",
        month: "มกราคม 2566",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.81,
            west: 99.02,
            total: 99.50
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 99.54,
            total: 99.82
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 99.93,
            total: 99.97
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 96050,
            west: 41436,
            total: 137486
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4278,
            west: 2850,
            total: 7128
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 2,
            total: 2
        }
    },
    {
        id: "2023-02",
        month: "กุมภาพันธ์ 2566",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.77,
            west: 99.84,
            total: 99.80
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.97,
            west: 100,
            total: 99.98
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 86463,
            west: 37452,
            total: 123915
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 3851,
            west: 2576,
            total: 6427
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2023-03",
        month: "มีนาคม 2566",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.74,
            west: 99.89,
            total: 99.80
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.98,
            west: 99.96,
            total: 99.97
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 96050,
            west: 41465,
            total: 137515
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4278,
            west: 2852,
            total: 7130
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2023-04",
        month: "เมษายน 2566",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.83,
            west: 99.49,
            total: 99.70
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.90,
            west: 99.86,
            total: 99.88
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 92951,
            west: 40128,
            total: 133079
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4140,
            west: 2760,
            total: 6900
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2023-05",
        month: "พฤษภาคม 2566",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.32,
            west: 99.68,
            total: 99.47
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.70,
            west: 99.96,
            total: 99.80
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.93,
            west: 100,
            total: 99.96
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 95982,
            west: 41465,
            total: 137448
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4275,
            west: 2852,
            total: 7127
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 3,
            west: 0,
            total: 3
        }
    },
    {
        id: "2023-06",
        month: "มิถุนายน 2566",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.86,
            west: 99.75,
            total: 99.81
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 99.96,
            total: 99.99
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 92951,
            west: 40128,
            total: 133079
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4140,
            west: 2760,
            total: 6900
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2023-07",
        month: "กรกฎาคม 2566",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.86,
            west: 99.96,
            total: 99.90
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.98,
            west: 100,
            total: 99.99
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 96050,
            west: 41465,
            total: 137515
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4278,
            west: 2852,
            total: 7130
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2023-08",
        month: "สิงหาคม 2566",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.94,
            west: 99.69,
            total: 99.84
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.94,
            west: 99.82,
            total: 99.89
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 99.97,
            total: 99.99
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 111317,
            west: 47383,
            total: 158700
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4958,
            west: 3259,
            total: 8217
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 1,
            total: 1
        }
    },
    {
        id: "2023-09",
        month: "กันยายน 2566",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.96,
            west: 99.66,
            total: 99.84
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 99.94,
            total: 99.98
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 99.97,
            total: 99.99
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 119894,
            west: 50581,
            total: 170475
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5340,
            west: 3479,
            total: 8819
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 1,
            total: 1
        }
    },
    {
        id: "2023-10",
        month: "ตุลาคม 2566",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.96,
            west: 99.92,
            total: 99.95
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.98,
            west: 99.97,
            total: 99.98
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 123890,
            west: 52282,
            total: 176172
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5518,
            west: 3596,
            total: 9114
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2023-11",
        month: "พฤศจิกายน 2566",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.89,
            west: 99.91,
            total: 99.90
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.94,
            west: 100,
            total: 99.97
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.98,
            west: 100,
            total: 99.99
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 119871,
            west: 50596,
            total: 170467
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5339,
            west: 3480,
            total: 8819
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 1,
            west: 0,
            total: 1
        }
    },
    {
        id: "2023-12",
        month: "ธันวาคม 2566",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.93,
            west: 100,
            total: 99.96
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 124788,
            west: 52718,
            total: 177507
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5558,
            west: 3626,
            total: 9184
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2024-01",
        month: "มกราคม 2567",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.95,
            west: 99.97,
            total: 99.96
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.98,
            west: 100,
            total: 99.99
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 124249,
            west: 52457,
            total: 176706
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5534,
            west: 3608,
            total: 9142
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2024-02",
        month: "กุมภาพันธ์ 2567",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.57,
            west: 99.67,
            total: 99.61
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.65,
            west: 99.85,
            total: 99.73
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.83,
            west: 99.88,
            total: 99.85
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 115269,
            west: 48851,
            total: 164120
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5134,
            west: 3360,
            total: 8494
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 9,
            west: 4,
            total: 13
        }
    },
    {
        id: "2024-03",
        month: "มีนาคม 2567",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.98,
            west: 99.39,
            total: 99.75
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 99.58,
            total: 99.84
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 99.67,
            total: 99.87
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 123711,
            west: 52108,
            total: 175818
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5510,
            west: 3584,
            total: 9094
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 12,
            total: 12
        }
    },
    {
        id: "2024-04",
        month: "เมษายน 2567",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.98,
            west: 99.77,
            total: 99.90
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.98,
            west: 99.94,
            total: 99.97
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 120612,
            west: 50945,
            total: 171557
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5372,
            west: 3504,
            total: 8876
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2024-05",
        month: "พฤษภาคม 2567",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.62,
            west: 100,
            total: 99.77
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.75,
            west: 100,
            total: 99.85
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.82,
            west: 100,
            total: 99.89
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 123666,
            west: 52282,
            total: 175948
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5508,
            west: 3596,
            total: 9104
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 10,
            west: 0,
            total: 10
        }
    },
    {
        id: "2024-06",
        month: "มิถุนายน 2567",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.91,
            west: 100,
            total: 99.94
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.93,
            west: 100,
            total: 99.95
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.96,
            west: 100,
            total: 99.98
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 119849,
            west: 50596,
            total: 170444
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5338,
            west: 3480,
            total: 8818
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 2,
            west: 0,
            total: 2
        }
    },
    {
        id: "2024-07",
        month: "กรกฎาคม 2567",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.82,
            west: 100,
            total: 99.89
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.98,
            west: 100,
            total: 99.99
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 123890,
            west: 52282,
            total: 176172
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5518,
            west: 3596,
            total: 9114
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2024-08",
        month: "สิงหาคม 2567",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.98,
            west: 100,
            total: 99.99
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 123890,
            west: 52282,
            total: 176172
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5518,
            west: 3596,
            total: 9114
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2024-09",
        month: "กันยายน 2567",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.61,
            west: 99.91,
            total: 99.73
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.83,
            west: 99.91,
            total: 99.86
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.94,
            west: 99.94,
            total: 99.94
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 119826,
            west: 50567,
            total: 170393
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5337,
            west: 3478,
            total: 8815
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 3,
            west: 2,
            total: 5
        }
    },
    {
        id: "2024-10",
        month: "ตุลาคม 2567",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.33,
            west: 99.94,
            total: 99.57
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.49,
            west: 100,
            total: 99.69
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.58,
            west: 100,
            total: 99.75
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 123374,
            west: 52282,
            total: 175656
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5495,
            west: 3596,
            total: 9091
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 23,
            west: 0,
            total: 23
        }
    },
    {
        id: "2024-11",
        month: "พฤศจิกายน 2567",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 100,
            west: 99.91,
            total: 99.97
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 119894,
            west: 50596,
            total: 170489
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5340,
            west: 3480,
            total: 8820
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2024-12",
        month: "ธันวาคม 2567",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 100,
            west: 99.86,
            total: 99.95
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 99.86,
            total: 99.95
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 99.86,
            total: 99.95
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 124249,
            west: 52384,
            total: 176633
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5534,
            west: 3603,
            total: 9137
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 5,
            total: 5
        }
    },
    {
        id: "2025-01",
        month: "มกราคม 2568",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 123890,
            west: 52282,
            total: 176172
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5518,
            west: 3596,
            total: 9114
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2025-02",
        month: "กุมภาพันธ์ 2568",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.92,
            west: 100,
            total: 99.95
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.98,
            west: 100,
            total: 99.99
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 111901,
            west: 47165,
            total: 159065
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4984,
            west: 3244,
            total: 8228
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2025-03",
        month: "มีนาคม 2568",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.89,
            west: 100,
            total: 99.93
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 121600,
            west: 51235,
            total: 172835
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5416,
            west: 3524,
            total: 8940
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2025-04",
        month: "เมษายน 2568",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.94,
            west: 99.83,
            total: 99.90
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.96,
            west: 99.86,
            total: 99.92
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 119759,
            west: 50596,
            total: 170355
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5334,
            west: 3480,
            total: 8814
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2025-05",
        month: "พฤษภาคม 2568",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.91,
            west: 100,
            total: 99.95
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 123711,
            west: 52253,
            total: 175964
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5510,
            west: 3594,
            total: 9104
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2025-06",
        month: "มิถุนายน 2568",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.93,
            west: 99.89,
            total: 99.91
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.96,
            west: 100,
            total: 99.98
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 119894,
            west: 50596,
            total: 170489
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5340,
            west: 3480,
            total: 8820
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2025-07",
        month: "กรกฎาคม 2568",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.95,
            west: 100,
            total: 99.97
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 123890,
            west: 52282,
            total: 176172
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5518,
            west: 3596,
            total: 9114
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2025-08",
        month: "สิงหาคม 2568",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.93,
            west: 100,
            total: 99.96
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.98,
            west: 100,
            total: 99.99
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 123890,
            west: 52282,
            total: 176172
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5518,
            west: 3596,
            total: 9114
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2025-09",
        month: "กันยายน 2568",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.81,
            west: 99.94,
            total: 99.86
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.98,
            west: 99.97,
            total: 99.98
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 99.94,
            total: 99.98
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 119894,
            west: 50567,
            total: 170460
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5340,
            west: 3478,
            total: 8818
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 2,
            total: 2
        }
    },
    {
        id: "2025-10",
        month: "ตุลาคม 2568",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.76,
            west: 99.44,
            total: 99.64
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.96,
            west: 99.75,
            total: 99.88
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 99.56,
            total: 99.82
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 123890,
            west: 52050,
            total: 175940
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5518,
            west: 3580,
            total: 9098
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 16,
            total: 16
        }
    },
    {
        id: "2025-11",
        month: "พฤศจิกายน 2568",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 98.63,
            west: 99.91,
            total: 99.14
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.94,
            west: 100,
            total: 99.97
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 119894,
            west: 50538,
            total: 170431
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5340,
            west: 3476,
            total: 8816
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 4,
            total: 4
        }
    },
    {
        id: "2025-12",
        month: "ธันวาคม 2568",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.95,
            west: 99.97,
            total: 99.96
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 124249,
            west: 52457,
            total: 176706
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5534,
            west: 3608,
            total: 9142
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2026-01",
        month: "มกราคม 2569",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.82,
            west: 99.78,
            total: 99.80
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.93,
            west: 100,
            total: 99.96
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.95,
            west: 100,
            total: 99.97
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 123823,
            west: 52282,
            total: 176105
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5515,
            west: 3596,
            total: 9111
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 3,
            west: 0,
            total: 3
        }
    },
    {
        id: "2026-02",
        month: "กุมภาพันธ์ 2569",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 111901,
            west: 47223,
            total: 159123
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 4984,
            west: 3248,
            total: 8232
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2026-03",
        month: "มีนาคม 2569",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.96,
            west: 99.94,
            total: 99.96
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 123890,
            west: 52282,
            total: 176172
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5518,
            west: 3596,
            total: 9114
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2026-04",
        month: "เมษายน 2569",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.78,
            west: 100,
            total: 99.86
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.83,
            west: 100,
            total: 99.90
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 99.93,
            west: 100,
            total: 99.95
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 119804,
            west: 50567,
            total: 170371
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5336,
            west: 3478,
            total: 8814
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 4,
            west: 0,
            total: 4
        }
    },
    {
        id: "2026-05",
        month: "พฤษภาคม 2569",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.91,
            west: 99.94,
            total: 99.92
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 99.96,
            west: 100,
            total: 99.98
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 123890,
            west: 52282,
            total: 176172
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5518,
            west: 3596,
            total: 9114
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    },
    {
        id: "2026-06",
        month: "มิถุนายน 2569",

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 5 นาที
        punctuality5: {
            north: 99.96,
            west: 100,
            total: 99.98
        },

        // ความตรงต่อเวลา: ความล่าช้าไม่เกิน 10 นาที
        onTime: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความน่าเชื่อถือ / TSA
        reliability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ความพร้อมของขบวนรถไฟ / TA
        // หมายเหตุ: ชีต Average TSP + TSA + TA มีค่า TA เฉพาะ RED LINE รวมทั้ง 2 สาย
        availability: {
            north: 100,
            west: 100,
            total: 100
        },

        // ระยะทางที่วิ่งให้บริการ = จำนวนเที่ยววิ่งจริง × ระยะทางของแต่ละสาย
        // NL = 22.452 กม. / WL = 14.539 กม.
        distance: {
            north: 119894,
            west: 50581,
            total: 170475
        },

        // จำนวนเที่ยววิ่งจริง
        trips: {
            north: 5340,
            west: 3479,
            total: 8819
        },

        // การยกเลิกเที่ยววิ่ง = เที่ยวตามตารางเดินรถ - เที่ยวจริง
        cancelled: {
            north: 0,
            west: 0,
            total: 0
        }
    }
];
